#+title: Day1
#+property: header-args

** Hello World in C
#+name: hello.c
#+begin_src C :tangle hello.c :results output :exports both
#include<stdio.h>
int main(){
    printf("Hello World\n");
    return 0;
}

#+end_src

#+results: hello.c
: hello world

** Hello World just by using MPI
#+name: hello_mpi.c
#+begin_src C :tangle hello_mpi.c :results output :exports both
#include<stdio.h>
int main(){
    printf("Hello World\n");
    return 0;
}

#+end_src

#+name: compile hello_mpi.c
#+begin_src bash :results output :exports both
bash compile.sh hello_mpi.c
#+end_src

#+RESULTS: compile hello_mpi.c
: ------------------------------------------------------------------
: Command executed: mpicc hello_mpi.c -o hello_mpi.out
: ------------------------------------------------------------------
: Compilation successful. Check at hello_mpi.out
: ------------------------------------------------------------------

#+name: run hello_mpi.out
#+begin_src bash :results output :exports both
bash run.sh ./hello_mpi.out 6
#+end_src

#+RESULTS: run hello_mpi.out
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 6 ./hello_mpi.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

Hello World
Hello World
Hello World
Hello World
Hello World
Hello World

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

** Hello World with MPI routines
#+name: hello_mpi_processes.c
#+begin_src C :tangle hello_mpi_processes.c :results output :exports both
#include<stdio.h>
#include<mpi.h>         // for using mpi functions
int main(){
    int size, rank;
    MPI_Init(NULL, NULL);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    printf("Hello from process %d\n", rank);
    MPI_Finalize();
    return 0;
}
#+end_src

#+name: compile hello_mpi_processes.c
#+begin_src bash :results output :exports both
bash compile.sh hello_mpi_processes.c
#+end_src

#+RESULTS: compile hello_mpi_processes.c
: ------------------------------------------------------------------
: Command executed: mpicc hello_mpi_processes.c -o hello_mpi_processes.out
: ------------------------------------------------------------------
: Compilation successful. Check at hello_mpi_processes.out
: ------------------------------------------------------------------

#+name: run hello_mpi_processes.out
#+begin_src bash :results output :exports both
bash run.sh ./hello_mpi_processes.out 8
#+end_src

#+RESULTS: run hello_mpi_processes.out
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 8 ./hello_mpi_processes.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

Hello from process 1
Hello from process 0
Hello from process 7
Hello from process 2
Hello from process 6
Hello from process 5
Hello from process 4
Hello from process 3

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

** Hello from only even rank of processes
#+name: hello_mpi_even_processes.c
#+begin_src C :tangle hello_mpi_even_processes.c :exports both
#include<stdio.h>
#include<mpi.h>         // for using mpi functions
int main(){
    int size, rank;
    MPI_Init(NULL, NULL);
    MPI_Comm_size(MPI_COMM_WORLD, &size);
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    if(rank % 2 == 0)
        printf("Hello from process %d\n", rank);
    MPI_Finalize();
    return 0;
}
#+end_src

#+name: compile hello_mpi_even_processes.c
#+begin_src bash :results output :exports both
bash compile.sh hello_mpi_even_processes.c
#+end_src

#+RESULTS: compile hello_mpi_even_processes.c
: ------------------------------------------------------------------
: Command executed: mpicc hello_mpi_even_processes.c -o hello_mpi_even_processes.out
: ------------------------------------------------------------------
: Compilation successful. Check at hello_mpi_even_processes.out
: ------------------------------------------------------------------

#+name: run hello_mpi_even_processes.out
#+begin_src bash :results output :exports both
bash run.sh ./hello_mpi_even_processes.out 10
#+end_src

#+RESULTS: run hello_mpi_even_processes.out
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 10 ./hello_mpi_even_processes.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

Hello from process 0
Hello from process 4
Hello from process 6
Hello from process 2
Hello from process 8

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example
